app/views/transactions/new.html.erb

    <%= label_tag :user %>
    <%= select_tag :sender_id, options_for_select(User.all.collect{ |u| [u.name, u.id] }), { required: true } %>
---
SELECT "users".* FROM "users"

    <%= label_tag :team %>
    <%= select_tag :sender_id, options_for_select(Team.all.collect{ |u| [u.name, u.id] }), { required: true, disabled: "disabled" } %>
---
SELECT "teams".* FROM "teams"

    <%= label_tag :stock %>
    <%= select_tag :sender_id, options_for_select(Stock.all.collect{ |u| [u.name, u.id] }), { required: true, disabled: "disabled" } %>
---
SELECT "stocks".* FROM "stocks"

    <%= label_tag :user %>
    <%= select_tag :recipient_id, options_for_select(User.all.collect{ |u| [u.name, u.id] }), { required: true } %>
---
SELECT "users".* FROM "users"

    <%= label_tag :team %>
    <%= select_tag :recipient_id, options_for_select(Team.all.collect{ |u| [u.name, u.id] }), { required: true, disabled: "disabled" } %>
---
SELECT "teams".* FROM "teams"

    <%= label_tag :stock %>
    <%= select_tag :recipient_id, options_for_select(Stock.all.collect{ |u| [u.name, u.id] }), { required: true, disabled: "disabled" } %>
---
SELECT "stocks".* FROM "stocks"